# Pandas is a python library for dealing with larg dataset, it is based on numy and some may call it the python version of excel.

In [2]:
# importing the libraries
import numpy as np
import pandas as pd

## pandas has two different types (Series and Dataframes)
### 1-Series: very simmilat to numpy array but the main difference is that Series can have labels (indecies)

In [2]:
labels = ['a', 'b', 'c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {
    'a': 10,
    'b': 20,
    'c': 30
}
d, arr, labels, my_data

({'a': 10, 'b': 20, 'c': 30},
 array([10, 20, 30]),
 ['a', 'b', 'c'],
 [10, 20, 30])

In [3]:
# creating a series from a list
pd.Series(data = my_data) # this is gonna give you a Series with default index (0,1,2,3,...)

0    10
1    20
2    30
dtype: int64

In [4]:
# also you can indicate the indecies for the series
pd.Series(data=my_data, index=labels)
# there is another way to do that withour writing data= or labels=
pd.Series(my_data, labels)

a    10
b    20
c    30
dtype: int64

In [5]:
# creating a series from an array
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int64

In [6]:
# creating a Series from a dictionary {note that dict has always the labels which are the key items}
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [7]:
# another main diff. between Series and numpy array is that Series can hold any type of data like strings or even functions and classes
pd.Series(data=['one', 'two', 'three']), pd.Series(data=[sum, print, len, map])

(0      one
 1      two
 2    three
 dtype: object, 0      <built-in function sum>
 1    <built-in function print>
 2      <built-in function len>
 3                <class 'map'>
 dtype: object)

## indexing a Series

In [8]:
ser1 = pd.Series([1,2,3,4], ['USA', 'Germany', 'USSR', 'Japan'])
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [9]:
ser2 = pd.Series([1,2,5,4], ['USA', 'Germany', 'Italy', 'Japan'])
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [10]:
# graping information from a series is simillar to python dict.
ser1['USSR'], ser2['Italy'] # i am typing this as  string as the index is a string.

(3, 5)

In [11]:
ser3 = pd.Series(data=labels) # creating a series with the default number index
ser3

0    a
1    b
2    c
dtype: object

In [12]:
ser3[0] # and you can grap information by the index number

'a'

## Series operations are based on the index:

In [13]:
ser1 + ser2 # this will get the sum of matched indecies and the ones that are not matched will pass as NaN

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

# 2- DataFrames: the main tool of working with pandas.

In [14]:
np.random.seed(101) # generate the same random numbers every time this cell runs
df = pd.DataFrame(np.random.randn(5,4), ['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])
df # this is gonna give you a DataFrame with index(rows) > 'A', 'B', 'C', 'D', 'E'
# and columns(Serieses) > 'W', 'X', 'Y', 'Z']

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

## selection of columns from a dataframe

In [15]:
df['W'] # grap the column <Series> by name as it look like series

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [16]:
# So each column is actually a series and to prove that see its type as folows:
type(df['W'])

pandas.core.series.Series

In [17]:
# simillar to sql you can grap a column by the dot notation but this is not favorable 
# as this may rewrite an existing function 
# so it is favorable to use the bracket notaion for one or more than one column
df.X

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [18]:
# for multible columns df[[list of columns]]
df[['W', 'X']]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

## creating a new column in the dataframe

In [19]:
# creating new column is easy as you only need 
# to specify the name of the column and pass its values
df['New'] = df['W'] + df['Y'] # the new column is the sum of the two columns W and Y
df # the new column is in place

          W         X         Y         Z       New
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

## dropping a column or a row from the dataframe

In [20]:
# deleting a column
df.drop('New', axis=1) # axis = 1 means column while axis = 0 means index or row

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [21]:
df # notice that the New column still remains in the df dataframe

          W         X         Y         Z       New
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [22]:
# to completely remove the column you need to pass an additional argument (inplace=True)
df.drop('New', axis=1, inplace=True)

In [23]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [24]:
# also you can drop rows
df.drop('A', axis=0)

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [27]:
df.shape # this returns a tuple (rows, columns)

(5, 4)

## Selection of ``rows`` from a DataFrame

In [28]:
df.loc['A'] # loc stands for location loc['row you want (label)'] >>> location or label based index

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [29]:
df.iloc[0] # Use the index of the row instead of the row label >>> numerical based index

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [30]:
# df.loc[row,cloumn]
df.loc['B', 'Y']

-0.8480769834036315

In [31]:
# df.loc[[list of rows you want], [list of columns you want]] >>> for a subset of values from the dataframe
df.loc[['A', 'D'], ['X', 'W']]

          X         W
A  0.628133  2.706850
D -0.758872  0.188695

## ``Conditional Selection`` using bracket notation

In [33]:
bool_df = df > 0 # this is gonna returns a boolean dataframe based on the condition stated
bool_df

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [34]:
df[df>0] # this is gonna return all the values that are greater than 0 and those that are not greater than 0 will be NaN.

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [35]:
df['W'] > 0 # boolean vlaues of column 'W' based on condition stated

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [36]:
df[df['W'] > 0] # this is gonna return all the rows where 'W' is greater than 0, here there is no NaN values.

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [38]:
result_df =  df[df['Z'] < 0 ]
result_df # creating a new dataframe by filtering the original dataframe using conditional selection

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [39]:
result_df['X'] # you can treat this as normal dataframe

C    0.740122
Name: X, dtype: float64

In [41]:
# and you can put all of this in a single step
df[df['W'] > 0][['X', 'Z']] # this is gonna return the columns 'X' and 'Z' where the rows of 'W' are greater than 0

          X         Z
A  0.628133  0.503826
B -0.319318  0.605965
D -0.758872  0.955057
E  1.978757  0.683509

In [42]:
# the previous cell can be written as well on multible lines
bool_ser = df['W'] > 0
result = df[bool_ser]
my_col = ['X', 'Z']
result[my_col]
# the simple line is more effecient as you use less ram in that case than the mutible lines case.

          X         Z
A  0.628133  0.503826
B -0.319318  0.605965
D -0.758872  0.955057
E  1.978757  0.683509

In [43]:
df[df['Z']<0][['W', 'Y']] # you need to practics this alot as you will need this in machine learning.

          W         Y
C -2.018168  0.528813

In [45]:
# and operator can deals with only single boolean values so it can not be used when working with pandas so you can do the following:
df[(df['W'] > 0) & (df['Y']<0)] # & means and , | means or.

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [46]:
df[(df['W'] > 0) | (df['Y']<0)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [47]:
df['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [48]:
df['Y'] <0

A    False
B     True
C    False
D     True
E    False
Name: Y, dtype: bool

## resetting the index or setting it to something else

In [49]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [50]:
df.reset_index() # here the index is reset to a column and the actual index becomes numerical

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [51]:
df # you need to pass the (inplace = True) to keep the changes

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [52]:
new_ind = 'CA NY WY OR CO'.split()
new_ind

['CA', 'NY', 'WY', 'OR', 'CO']

In [54]:
df['States'] = new_ind # creating a new column
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [55]:
# if you want to a particular column to become the index use the (set_index('name of column'))
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [56]:
df # also you need to pass the inplace argument if you want to keep changes

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

## Hierarchical indexing (MultiIndex)

In [58]:
# Index Levels
outside = ['A', 'A', 'A', 'B', 'B', 'B']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [60]:
list(zip(outside, inside)) # grouping the outside and inside indecies to gether in a tuple

[('A', 1), ('A', 2), ('A', 3), ('B', 1), ('B', 2), ('B', 3)]

In [61]:
pd.MultiIndex.from_tuples(list(zip(outside, inside))) # creates a muti index level data frame from the tuple created by zip()

MultiIndex([('A', 1),
            ('A', 2),
            ('A', 3),
            ('B', 1),
            ('B', 2),
            ('B', 3)],
           )

In [62]:
# creating a dataframe whith the multi index level dataframe
df = pd.DataFrame(data=np.random.randn(6,2), index=hier_index, columns=['col 1', 'col 2'])

In [63]:
df

        col 1     col 2
A 1  0.302665  1.693723
  2 -1.706086 -1.159119
  3 -0.134841  0.390528
B 1  0.166905  0.184502
  2  0.807706  0.072960
  3  0.638787  0.329646

## calling data from a multi level index:

In [64]:
df.loc['A'] # graping from the outside index

      col 1     col 2
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [66]:
df.loc['B'].loc[[1]] # call from the outside index and continue to call in the inside deeper.

      col 1     col 2
1  0.166905  0.184502

In [67]:
df # notice that the index col are not named

        col 1     col 2
A 1  0.302665  1.693723
  2 -1.706086 -1.159119
  3 -0.134841  0.390528
B 1  0.166905  0.184502
  2  0.807706  0.072960
  3  0.638787  0.329646

In [68]:
df.index.names = ['Outside index', 'Inside index'] # naming the index columns (not related to the other columns)
df

                               col 1     col 2
Outside index Inside index
A             1             0.302665  1.693723
              2            -1.706086 -1.159119
              3            -0.134841  0.390528
B             1             0.166905  0.184502
              2             0.807706  0.072960
              3             0.638787  0.329646

In [69]:
df.loc['B'].loc[[2]]

                 col 1    col 2
Inside index
2             0.807706  0.07296

In [71]:
df.loc['B'].loc[2]['col 2']

0.07295967531703869

In [72]:
df.loc['A'].loc[3]['col 1']

-0.13484072060601238

## cross section function (df.xs)

In [73]:
# df.xs returns a cross section from a dataframe with a multi line index
df.xs('A') # returns a section of the Group 'A' >> skip or go inside a multi line index

                 col 1     col 2
Inside index
1             0.302665  1.693723
2            -1.706086 -1.159119
3            -0.134841  0.390528

In [87]:
# df.xs(index, level='name of index')
df.xs(1, level='Inside index') # this will return a cross section of inside index (1) within both outside index 'A', 'B' >> this is more triky in .loc[]

                  col 1     col 2
Outside index
A              0.302665  1.693723
B              0.166905  0.184502

## Dealing with Missing Data

In [101]:
df = pd.DataFrame({
    'A': [1,2,3,5],
    'B': [np.nan,2,84,6],
    'C': [np.nan,84,8,np.nan]
})
df # this is a dataframe with a NaN <empty> values

   A     B     C
0  1   NaN   NaN
1  2   2.0  84.0
2  3  84.0   8.0
3  5   6.0   NaN

In [102]:
df.dropna() # removing any empty values

   A     B     C
1  2   2.0  84.0
2  3  84.0   8.0

In [103]:
df.dropna(axis=1) # drop any column with a null value

   A
0  1
1  2
2  3
3  5

In [104]:
df.dropna(axis=0) # drop any row with a null value

   A     B     C
1  2   2.0  84.0
2  3  84.0   8.0

In [105]:
# specifying a thresh argument which specify the least number of null values for a column or a row to be dropped
df.dropna(thresh=2) # this will drop all the rows with 2 or more null values

   A     B     C
1  2   2.0  84.0
2  3  84.0   8.0
3  5   6.0   NaN

In [106]:
# replacing those missing values
df.fillna(value='filled value')

   A             B             C
0  1  filled value  filled value
1  2             2            84
2  3            84             8
3  5             6  filled value

In [109]:
# usually we fill the missing values with the mean of the column it is in
df[['C']].fillna(value=df[['C']].mean())

      C
0  46.0
1  84.0
2   8.0
3  46.0

## ```Groupby``` method to group dataframes together and call aggregate functions on them

In [110]:
data = {'company': ['goog', 'goog', 'msft', 'msft', 'fb', 'fb'],
       'person': ['sam', 'charlie', 'amy', 'vanessa', 'carl', 'sarah'],
       'sales': [200, 120,340,124,243,350]}

In [111]:
df = pd.DataFrame(data)
df

  company   person  sales
0    goog      sam    200
1    goog  charlie    120
2    msft      amy    340
3    msft  vanessa    124
4      fb     carl    243
5      fb    sarah    350

In [113]:
by_comp = df.groupby('company') # now we have groupby object that we can call aggregate funcitons on it.
by_comp

In [114]:
by_comp.sum() # notice that the 'person' column is droped as it can not be grouped

         sales
company
fb         593
goog       320
msft       464

In [115]:
by_comp.mean()

         sales
company
fb       296.5
goog     160.0
msft     232.0

In [116]:
by_comp.std() # standered deviation : square root of variance

              sales
company
fb        75.660426
goog      56.568542
msft     152.735065

In [118]:
# in the previous example the aggregate functions return a dataframe with the index being (goruped rows values) and you can use this new index as folow
# for selection
by_comp.sum()[['sales']]

         sales
company
fb         593
goog       320
msft       464

In [120]:
by_comp.sum().loc[['fb']] # return the sum of 'fb'

         sales
company
fb         593

### some other useful aggregate functions

In [121]:
df.groupby('company').count() #counts the number of instances with in a column for each company

         person  sales
company
fb            2      2
goog          2      2
msft          2      2

In [123]:
by_comp.max() # retruns the maximum index of each index (company)

          person  sales
company
fb         sarah    350
goog         sam    200
msft     vanessa    340

In [124]:
by_comp.min()

          person  sales
company
fb          carl    243
goog     charlie    120
msft         amy    124

In [126]:
df.groupby('company').describe() # this is gonna give you a bunch of information about each company

        sales
        count   mean         std    min     25%    50%     75%    max
company
fb        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
goog      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
msft      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [127]:
# if you prefer each company to be a column you can do use the transpose func.
df.groupby('company').describe().transpose()

company              fb        goog        msft
sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [131]:
# also you can access inforamtion about particular company
df.groupby('company').describe().transpose()[['goog']]

company            goog
sales count    2.000000
      mean   160.000000
      std     56.568542
      min    120.000000
      25%    140.000000
      50%    160.000000
      75%    180.000000
      max    200.000000

## Operations in Pandas

In [3]:
df = pd.DataFrame({
    'col1': [1,2,3,4],
    'col2': [444,555,666,444],
    'col3': ['abc', 'def', 'ghi', 'xyz']
})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [4]:
# finding unique vlaues within a dataframe
df['col2'].unique() # find the unique files in col2 (values not repeated)

array([444, 555, 666])

In [5]:
len(df['col2'].unique()) # number of unique values in col2

3

In [6]:
df['col2'].nunique() # number of unique values in col2

3

In [9]:
df['col2'].value_counts() # shows unique values and how many time they show up

444    2
555    1
666    1
Name: col2, dtype: int64

## Selecting data

In [10]:
df[df['col1'] > 2] # example of conditional selection

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [11]:
df['col1'] > 2 # the a bolean series of (True and False)

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [12]:
df[(df['col1'] > 2) & (df['col2']==444)] # using and'&' - or'|' with conditional selection

   col1  col2 col3
3     4   444  xyz

In [14]:
# if you want to apply your own fnuction on a particular column within a dataframe use <.apply()>
# df['col'].apply(your_function)
df[['col1']].apply(lambda var: var*2)

   col1
0     2
1     4
2     6
3     8

In [20]:
df['col3'].apply(lambda string: len(string)) # returns the length of each string in 'col3'

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [22]:
# removing col1
df.drop('col1', axis=1) # to permenantly remove col1 you need to indicate the inplace arg

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [24]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [25]:
df.columns # return informations about the columns of dataframe 'df'

Index(['col1', 'col2', 'col3'], dtype='object')

In [26]:
df.index # return informations about the index of dataframe 'df'

RangeIndex(start=0, stop=4, step=1)

In [27]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

## Sorting and ordering dataframe

In [28]:
# df.sort_vlaues(by=column_you_want_to_sort_by)
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [29]:
df.isnull() # returns a boolean dataframe to find if there is a null values 'NaN' within your dataframe

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [30]:
# and you can find the sum of null values within each column
df.isnull().sum()

col1    0
col2    0
col3    0
dtype: int64

In [32]:
data = {
    'A': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'],
    'B': ['one', 'one', 'two', 'two', 'one', 'one'],
    'C': ['x', 'y', 'x', 'y', 'x', 'y'],
    'D': [1,3,2,5,4,1]
}
df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [33]:
df.pivot_table(values='D', index=['A', 'B'], columns=['C']) # this creates a multi index with a column values specified at
# each combination of foo> one or two / bar > one or two

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

## Mergin, Joining, And Concatenating dataframes:

In [34]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                    index=[0, 1, 2, 3])
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [35]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']},
                    index=[4, 5, 6, 7])
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [36]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                    'B': ['B8', 'B9', 'B10', 'B11'],
                    'C': ['C8', 'C9', 'C10', 'C11'],
                    'D': ['D8', 'D9', 'D10', 'D11']},
                    index=[8, 9, 10, 11])
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

### 1- concatenation

In [37]:
# concatenation basically glues together the DataFrames. keep in mind that the dimensions should match along the axis
# you are trting to concatenate on.
pd.concat([df1, df2, df3], axis=0) # this joins the rows together

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [38]:
pd.concat([df1, df2, df3], axis=1) # this joins the rows together, NOTE: we have some missing values 'NaN' as any dataframe did not have
# all the index values you are trying to concatenate on.

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [39]:
left = pd.DataFrame({
    'key': ['K0', 'K1', 'K2', 'K3'],
    'A': ['A0', 'A1', 'A2', 'A3'],
    'B': ['B0', 'B1', 'B2', 'B3']
})

right = pd.DataFrame({
    'key': ['K0', 'K1', 'K2', 'K3'],
    'C': ['C0', 'C1', 'C2', 'C3'],
    'D': ['D0', 'D1', 'D2', 'D3']
})

In [41]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [42]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [43]:
# pd.merge(dataframe_1, dataframe_2, how='inner', on='column to merge on <same column they share>')
pd.merge(left, right, how='inner', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [46]:
# joining dataframes: combining the columns of two potentially different-idexed dataframes into a single result dataframe
# joining the index instead of the columns in the case of merge.
left = pd.DataFrame({
    'A': ['A0', 'A1', 'A2'],
    'B': ['B0', 'B1', 'B2']
}, index = ['K0', 'K1', 'K2'])

right = pd.DataFrame({
    'C': ['C0', 'C1', 'C2'],
    'D': ['D0', 'D1', 'D2']
}, index = ['K0', 'K2', 'K3'])

In [47]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [48]:
right

     C   D
K0  C0  D0
K2  C1  D1
K3  C2  D2

In [49]:
# dataframe.join(other_data_frames)
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C1   D1

# ``Data input and output ``

### pandas as a library has the ability to read and write data from and to wide varaity of sources like:
1. CSV
2. Excel
3. HTML from the web
4. SQL databases

### in order to work with HTML files and SQL databases you need to install the following 4 libraries:
```python
conda/pip install sqlalchemy
conda/pip install lxml
conda/pip install html5lib
conda/pip install beautifulsoup4
```

In [55]:
pwd

'/home/nemo/programing/machine_learning/jose_data_science/pandas'

In [52]:
# the previous directory should be the directory that contains the data (Excel, CSV) files should exist

In [57]:
# reading the CSV files
pd.read_csv('./example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [58]:
df = pd.read_csv('./example')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [59]:
# writing csv files
df.to_csv('./my_output.csv', index=False)

In [68]:
# reading excel files <pd.read_excel('path to excel file', sheet_name='Neme of Sheet')>
df = pd.read_excel('./Excel_Sample.xlsx', sheet_name='Sheet1')
df

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [69]:
# Writing excel files 
df.to_excel('./Excel_output.xlsx', sheet_name='NewSheet')

In [70]:
# Working with html, This is gonna read all the table elements within an html files
data = pd.read_html("https://www.fdic.gov/bank/individual/failed/banklist.html")
type(data) # notice that the type is a list of dataframes you need to cycle through them to get what you need

list

In [71]:
data[0] # we will need here the first dataframe in the list

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
1,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
2,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"
3,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019"
4,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017"
...,...,...,...,...,...,...
554,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
555,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
556,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
557,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
558,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"

In [72]:
# reading sql tables and creating dataframes from them
from sqlalchemy import create_engine
engine = create_engine('sqlite:///:memory:') # this creates very small sqlite engine database that is running in memory

In [ ]:
# df.to_sql('name of the table', sql engin you working with)
df.to_sql('My Table', engine)

In [74]:
sqldf = pd.read_sql('My Table', con=engine) # specify the table and the connection which is engine
sqldf

   index  Unnamed: 0   a   b   c   d
0      0           0   0   1   2   3
1      1           1   4   5   6   7
2      2           2   8   9  10  11
3      3           3  12  13  14  15

# EXERCISES AND SOLUTIONS (VERY IMPORTANT)

In [77]:
# How to use a particular value within a dataframe
sal = pd.read_csv('./Salaries.csv')
sal.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [78]:
# find informations about the <sal> dataframe
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
Id                  148654 non-null int64
EmployeeName        148654 non-null object
JobTitle            148654 non-null object
BasePay             148045 non-null float64
OvertimePay         148650 non-null float64
OtherPay            148650 non-null float64
Benefits            112491 non-null float64
TotalPay            148654 non-null float64
TotalPayBenefits    148654 non-null float64
Year                148654 non-null int64
Notes               0 non-null float64
Agency              148654 non-null object
Status              0 non-null float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

In [79]:
# find the 'JobTitle' of 'JOSEPH DRISCOLL'
sal[sal['EmployeeName'] == 'JOSEPH DRISCOLL']['JobTitle'] # this can be done using conditional selection

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [81]:
# find the name of the lowest paied person in the Sal dataframe:
sal[sal['TotalPayBenefits'] == sal['TotalPayBenefits'].min()] # the one whose total pay benefits
# equal the lowest total pay benefits

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

In [84]:
# find the average (mean) BasePay for all employees per year? (2011, 2014)
sal.groupby('Year').mean()['BasePay']

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

In [89]:
# find unique job titles are there?
sal['JobTitle'].unique()

array(['GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY',
       'CAPTAIN III (POLICE DEPARTMENT)',
       'WIRE ROPE CABLE MAINTENANCE MECHANIC', ..., 'Conversion',
       'Cashier 3', 'Not provided'], dtype=object)

In [91]:
sal['JobTitle'].nunique() # number of unique JobTitles

2159

In [96]:
# the top 5 most common jobs
sal['JobTitle'].value_counts().head(5)

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

In [101]:
# how many jobs there were represented by only one person in 2013 (jobTitles with only one occurance in 2013)
sum(sal[sal['Year'] == 2013]['JobTitle'].value_counts() == 1)
# here this says find the sal[with the year == 2013] and from that get number 'value_counts()' of the jobs whome occurance is
# equal to one and then find the sum of al of this

202

In [110]:
sal[sal['Year'] == 2014]['JobTitle'].value_counts() == 1 # this is gonna return a boolean data

Transit Operator                  False
Special Nurse                     False
Registered Nurse                  False
Public Svc Aide-Public Works      False
Firefighter                       False
                                  ...
Assistant Deputy Chief 2           True
Media Training Specialist          True
City Shops Asst Superintendent     True
Shelter Officer Supervisor         True
Water Meter Shop Supervisor 1      True
Name: JobTitle, Length: 997, dtype: bool

In [114]:
sal.isnull().sum()

Id                       0
EmployeeName             0
JobTitle                 0
BasePay                609
OvertimePay              4
OtherPay                 4
Benefits             36163
TotalPay                 0
TotalPayBenefits         0
Year                     0
Notes               148654
Agency                   0
Status              148654
dtype: int64